class Solution:
    def isPalindrome(self, s: str) -> bool:
        l, r = 0, len(s) - 1 # Задаём начальные положения индексов. -1, чтобы обратиться к последнему элементу массива
        while l < r: # пока левый индекс меньше правого
            while l < r and not self.alphaNum(s[l]): # пока левый индекс меньше правого и символ не буква или цифра прибавляем к нему единицу
                l += 1
            while r > l and not self.alphaNum(s[r]):
                r -= 1 # Пока правый индекс больше левого и символ не буква или цифра вычитаем единицу из правого индекса
            # если символ слева не равен символу справа то возращаем False
            if s[l].lower() != s[r].lower():
                return False
            # Если всё нормально то просто сдвигаем индексы
            l, r = l + 1, r - 1
        # Возвращаем True если за всё время проверок не случилась ситуация когда символы слева и справа не равны
        return True

    # Тут просто проверка. Self, чтобы использовать эту функцию в этом классе. В c Мы передаём аргумент в виде символа. Функция возвращает булево значение.
    def alphaNum(self, c):
        return (ord('A') <= ord(c) <= ord('Z') or
                ord('a') <= ord(c) <= ord('z') or
                ord('0') <= ord(c) <= ord('9'))