class Solution:
    def longestConsecutive(self, nums: List[int]) -> int:
        numSet = set(nums) # Преобразуем список в множество
        longest = 0 # фиксируем самую длинную последовательность. Изначально 0

        for num in numSet: # Для каждого элемента в этом множестве
            if (num - 1) not in numSet: # Только если элемента на 1 меньше нету в этом множестве. Это чтобы избежать проверки последовательностей которые точно не являются самыми длинными так как если будет элемент на 1 меньше чем начало последовательностей, то у нас точно будет ещё более длинная последовательность.
                length = 1 # Устанавливаем счётчик в 1, чтобы начать считать длину последовательности.
                while (num + length) in numSet:
                    length += 1 # В этом цикле проверяем максимальную длину последовательности для элемента. Если есть элемент на один больше в множестве, то прибавляем 1 и проверяем снова есть ли элемент ещё на 1 больше. И так пока элементов на единицу больше не останется.
                longest = max(longest, length) # проверяем новая длина последовательности больше ли последней максимальной длинны последовательности.
        return longest