class Solution:
    def topKFrequent(self, nums: List[int], k: int) -> List[int]:
        count = {} # создаём пустой словарь для подсчёта элементов
        freq = [[] for i in range(len(nums) + 1)]
        # Создаём список списков. В нём каждый индекс это колво элемента, а содержание сам элемент.
        # минус 1 потому что индексы считаются с нуля
        # если в списке шесть пятёрок. То нужно прибавить индекс ведь изначально будет список с последним индексом 5. 
        # И нужно записать их под индексом 6

        for num in nums:
            count[num] = 1 + count.get(num, 0)
        # перебираем элементы изначального списка. 
        # Если список есть в словаре, то прибавляем к его количеству 1, 
        # если нет то заносим новый элемент в словарь и ставим количество 1. 
        # Метод get не даёт обратиться к не существующему элементу
        for num, cnt in count.items():
            freq[cnt].append(num)
        # метод items() извлекает ключ и значение в виде кортежа.
        # В данном случае num значение, а cnt количество
        # Мы берём количество и заносим под соответсвующий индекс в список число num. 
        # Список списков потому что одинаковое количество может быть у нескольких элементов

        res = [] # Список для результата
        for i in range(len(freq) - 1 , 0, -1):
        # берём длину списка списков и проходим в обратном порядке. Число len(freq) это колво элементов 
        # поэтому делаем минус 1 чтобы обратиться по индексу к крайнему элементу
            for num in freq[i]:
                # Получаем нужный список и проходимся уже по его элементам
                res.append(num) # Добавляем элементы в результат
                if len(res) == k: # если длина финального списка не больше ограничения, то продолжаем. Иначе возвращаем результат.
                    return res

        # В обратном порядке проходим, потому что нужно найти самые частые элементы. Частоте соответствуют индексы. Так что идём от наибольшего индекса.